{"meta":{"title":"People","layout":"default","isPage":true},"content":"\n  <section class=\"card profile\">\n    <div class=\"profile-picture\">\n      <img src=\"https://lh6.googleusercontent.com/-s2uf_B0hNTA/AAAAAAAAAAI/AAAAAAAAAh0/HZ7Lo_y3UUI/photo.jpg\"></img>\n    </div>\n    <header>\n      <h1>Jan Hein Hoogstad</h1>\n    </header>\n    <section>\n      <p><a href=\"http://www.linkedin.com/pub/jan-hein-hoogstad/75/22b/389\">Jan Hein Hoogstad</a> is an Assistant Professor in Cultural Analysis and Comparative Literature at the University of Amsterdam. This summer he was a coach and teaching assistant at Dev Bootcamp in San Francisco. In 2008, Jan Hein was a visiting professor at the University of Minnesota, Minneapolis and a research fellow at the Jan van Eyck Academy in Maastricht. He studied philosophy and media studies at the University of Utrecht and the Humboldt University in Berlin.</p>\n\n    </section>\n  </section>\n\n  <section class=\"card profile\">\n    <div class=\"profile-picture\">\n      <img src=\"http://b.vimeocdn.com/ts/160/337/160337101_640.jpg\"></img>\n    </div>\n    <header>\n      <h1>Marijn Koolen</h1>\n    </header>\n    <section>\n      <p><a href=\"http://linkedin.com/in/marijnkoolen\">Marijn Koolen</a> is an Assistant Professor of Digital Humanities at the University of Amsterdam.  Previously he was an Assistant Professor of Archives and Information Studies at the Media Studies department. He studied Artificial Intelligence, focusing on language and speech technologies. As a PhD student he did an internship with Microsoft Research Cambridge.</p>\n<p>Marijn is a member of the Institute for Logic, Language and Computation, working on Information Retrieval and Web Search. His current project is on Social Book Search, an international collaboration to develop and evaluate book search systems in the social web.</p>\n\n    </section>\n  </section>\n\n  <section class=\"card profile\">\n    <div class=\"profile-picture\">\n      <img src=\"http://jussiparikka.files.wordpress.com/2012/10/rbb_b-w.jpg\"></img>\n    </div>\n    <header>\n      <h1>Robin Boast</h1>\n    </header>\n    <section>\n      <p><a href=\"http://www.linkedin.com/pub/robin-boast/5/181/855\">Prof. Boast</a> has been working for over thirty years in what today we call Digital Humanities. His work has focused on diverse topics, ranging from the first digital collection projects in museums and universities to the more recent emergence of the Web and social computing, to the question of digitality itself. His recent research has focused on local knowledge and emergent systems across incommensurable expert communities (indigenous and scientific), where he focuses on the study and development of open source, social and distributive systems.</p>\n\n    </section>\n  </section>\n\n  <section class=\"card profile\">\n    <div class=\"profile-picture\">\n      <img src=\"http://farm9.staticflickr.com/8353/8268382691_8276999b70.jpg\"></img>\n    </div>\n    <header>\n      <h1>Rens Bod</h1>\n    </header>\n    <section>\n      <p>Rens Bod heads the <a href=\"http://http://http://codingthehumanities.com.uva.nl/\">Center for Digital Humanities</a> which currently runs 20 projects in all fields of digital humanities. He was previously at the University of St Andrews and is currently appointed at both the Faculty of Humanities and the Faculty of Science of the UvA. His research covers computational linguistics and computational historiography. He recently published a monograph with Oxford University Press on the overarching history of the humanities which has been translated into six languages. He is a recipient of an Advanced Research Fellowship from EPSRC (UK), an Academy Fellowship from KNAW (NL), a personal VIDI-grant (2001) and a personal VICI-grant (2007) from NWO (NL).</p>\n\n    </section>\n  </section>\n"}